Repository: oscarahalvorsen/masterproject
Catalog: datacollecting/MAALFRID/tmx/forsvaret.no.csv-en-nb.deduped.tmx
Source language: en
Languages: nb

source: The education has a duration of approximately 12 months, and consists of a combination of theory, simulator training and practical flying.
nb: Utdanningen har en varighet på omtrent 12 måneder, og består av en kombinasjon av teori, simulatortrening og praktisk flygning.

source: Field 2013 is proposed as a reference guide to SPSS.
nb: Field (2013) foreslås som oppslagsverk og guide til SPSS. Fadum, E.

source: After completion of the course, the cadet:
nb: Etter fullført emnet kan kadetten:

source: work in relevant laboratories and handle measurement methods, troubleshooting methodology, instruments, as well as other relevant methods and tools as a basis for targeted and innovative work.
nb: arbeide i relevante laboratorier og behersker målemetoder, feilsøkingsmetodikk, instrumenter, samt andre relevante metoder og verktøy som grunnlag for målrettet og innovativt arbeid.

source: * Be given an introduction to scientific research at bachelor level.
nb: * Gis en introduksjon til vitenskapelig produksjon på bachelornivå.

source: understand the importance of physical and mental capacity to develop physically and mentally robust officers and soldiers.
nb: forstå menneskets fysiske og mentale kapasitets betydning for å utvikle fysisk og mentalt robuste offiserer og soldater.

source: The officer and war
nb: Offiseren og krigen

source: Screw mechanism, gear and gear wheels.
nb: Skruemekanismen, tannhjul og gir.

source: • demonstrate and understanding of basic C syntax with types, variables, tests, loops and functions
nb: • vise forståelse av grunnleggende C-syntaks med typer, variabler, tester, løkker og funksjoner

source: Theme 2 will introduce cadets to fundamental historical and theoretical perspectives on the use of military force and provide basic knowledge about land, maritime, and air operations.
nb: Tema 2 skal introdusere kadettene for grunnleggende historiske og teoretiske perspektiver på bruk av militærmakt og kunnskap om grunnleggende forhold ved land-, sjø- og luftoperasjoner.

source: describe the main industry's main task and role in the Air Force and as part of the Armed Forces.
nb: bskrive egen bransjes hovedoppgave og rolle i Luftforsvaret og som en del av Forsvaret.

source: explain the context and influence between society, politics, and military power by presenting key examples of such contexts and influences from 1750 to the present.
nb: forklare sammenhengen og påvirkningen mellom samfunn, politikk og militærmakt ved å vise til sentrale eksempler på slike sammenhenger og påvirkninger fra 1750 og fram til i dag.

source: provide detailed knowledge on design and manner of operation.
nb: gjengi detaljkunnskaper om konstruksjon og virkemåte.

source: Contribute to the development of organization, training and exercises, materiel, leadership, teaching and interoperability in the Norwegian Armed Forces
nb: Bidra til utvikling av organisasjon, trening og øving, materiell, ledelse, undervisning og interoperabilitet i Forsvaret

source: The purpose of the course is to cover the Navy's requirements as well as satisfy the requirements of STCW 1978 with amendments within loading, unloading and stowage in the function loading, unloading and stowage at operational and management levels.
nb: Hensikten med emnet er å tilfredsstille Sjøforsvarets behov samt kravene i STCW 1978 med tillegg, innen lasting og lossing og stuing i funksjonen lasting lossing og stuing på operativt og ledelsesnivå.

source: Original text from 1954.
nb: Opprinnelig skrevet i 1954.

source: Explain key features of the most important II-related concepts, doctrines and directives
nb: Gjøre rede for hovedtrekk i sentrale INI-relaterte konsepter, doktriner og direktiver

source: Moreover, we will study the tactical level at which the operations (actions) are actually carried out.
nb: Og så vil vi studere det taktiske nivået der operasjonene (handlingene) faktisk gjennomføres.

source: Part 2: Protecting civilians from violence
nb: Del 2: Beskyttelse av sivile fra vold

source: But is this really true?
nb: Men er det virkelig slik?

source: apply effective on-board cooperation (CRM) procedures
nb: anvende effektive prosedyrer for samarbeid ombord(CRM)

source: STCW function: The course plan is based on IMO model course 7.03, Appendix 1, Mathematics, and Appendix 2, Physical Science.
nb: STCW-funksjon: Emneplanen tar utgangspunkt i IMO modellkurs 7.03, Appendix 1, Matematics, og Appendix 2, Physical Science.

source: The admission requirements for students taking individual courses are the same as for admission to the entire master's degree programme.
nb: Det stilles i tillegg krav om at studenter som tas opp til master i militære studier tilfredsstiller de gjeldende krav til sikkerhetsklarering.

source: • explain the principles of signal processing algorithms such as folding, correlation, discrete Fourier transform (DFT), inverse DFT and fast Fourier transform (FFT)
nb: • forklare det prinsippielle ved signalbehandlingsalgoritmer som folding, korrelasjon, diskret fourier transform (DFT), invers DFT og fast fourier transform (FFT)

source: This authorization is a requirement for further training against other authorizations within both control and notification, and it provides the necessary basic knowledge and understanding, regardless of the direction of specialization (control or notification).
nb: Denne autorisasjonen ligger som krav for videre trening mot andre autorisasjoner innen både kontroll og varsling, og den gir nødvendig grunnleggende kunnskap og forståelse, uavhengig av spesialiseringsretning (kontroll eller varsling).

source: The course follows STCW code A-III/2 and STCW function Marine engineering at the management level.
nb: Emnet følger STCW-kode A-III/2 og STCW-funksjon Maskineri på ledelsesnivå.

source: explain and demonstrate understanding of manner of operation, operation and monitoring of turbomachinery.
nb: forklare og vise forståelse for virkemåter, operering og overvåking av turbomaskineri.

source: Bachelor in military studies with specialisation in management – Naval Engineer weapon systems electronics and data, in combination with necessary functionally-oriented education, prepares the officers to serve at a lower and middle level in the Navy and the Armed Forces, in both war and peace setups.
nb: Bachelor i militære studier med fordypning i ledelse - marineingeniør våpensystemer, elektronikk og data, kombinert med nødvendig funksjonsrettet utdanning, forbereder offiserene til å kunne tjenestegjøre på lavere og midlere nivå i Sjøforsvaret og Forsvaret, i både krigs- og fredsoppsetninger.

source: - Critically analyze how military power can be used in peace operations to support the implementation of the mandate;
nb: - Kritisk analysere hvordan militærmakt kan anvendes i fredsoperasjoner for å støtte implementering av mandatet;

source: For this reason, the course will deal with relevant theoretical development and historical events (case studies) from the beginning of the 1900s to the present.
nb: I dette vil emnet behandle relevant teoriutvikling og historiske hendelser (tilfellestudier) i tidsperioden fra begynnelsen av 1900-tallet og frem til i dag.

source: monitor loading, stowage, securing and unloading of cargo and caring for cargo during the voyage.
nb: overvåke lasting, stuing, sikring og lossing av last og omsorgen for last under reisen.

source: The candidate has knowledge of problem solving, software development and the principles for constructing computer systems and networks.
nb: Kandidaten har kunnskap om problemløsning, programvareutvikling og prinsipper for oppbygging av datasystemer og nettverk.

source: Various design documents and operating manuals for the Norwegian Defense ICT systems
nb: Diverse designdokumenter og driftshåndbøker for Forsvarets IKT-systemer

source: Operational planning represents leadership in practice.
nb: Operativ planlegging representerer lederskap i praksis.

source: The course topics relative course and speed and mathematics in navigation should come early in semester 4.
nb: Delemnene relativ kurs og fart og matematikk i navigasjon bør komme primo semester 4.

source: Review of Reliability Centred Maintenance (RCM) and Failure Mode, Effects and Criticality Analysis (FMECA) techniques for determination of maintenance methods.
nb: Gjennomgang av Reliability Centered Maintenance (RCM) og Failure Mode, Effects and Criticality Analysis (FMECA) teknikkene for bestemmelse av vedlikeholdsmetoder.

source: This is based on the work requirement analysis that is drawn up in semester 1, and the experiences made in the topic "Troop Commander Basics".
nb: Dette med utgangspunkt i arbeidskravsanalysen som utarbeides i semester 1 og de erfaringer som gjøres i tema "Troppsjef grunnkurs".

source: The students conduct two case studies (South Sudan and Congo) that shed light on variations in peacekeeping and key dilemmas in the use of military forces in peacekeeping.
nb: Studentene gjennomfører to case-studier (Sør-Sudan og Kongo) som belyser variasjoner innen fredsbevaring og sentrale dilemmaer ved bruk av militære styrker i fredsbevaring.

source: Propeller/rudder shafts and fatigue
nb: Propell/ror aksler og utmatting

source: The course plan meets the IMO module courses 1.27 ECDIS, 1.08 ARPA and 1.34 AIS
nb: Emneplanen oppfyller IMO modulkursene 1.27 ECDIS, 1.08 ARPA og 1.34 AIS

source: Rudders and fins.
nb: Ror og finner.

source: • explain relevant formulas and arithmetic rules in discrete mathematics
nb: • forklare aktuelle formler og regneregler innen diskret matematikk

source: Stability when intact and damaged, surface vessels:
nb: Intakt og skade stabilitet, overflatefartøyer:

source: The basic education consists of theory, simulator training and practical flying.
nb: Grunnutdanningen består av teori, simulatortrening og praktisk flygning.

source: Chapter 1.9 Manoeuvre the ship
nb: kapittel 1.9 Fartøysmanøver

source: One attempts in this module to create an understanding of concepts rather than a detailed knowledge of existing material in the army.
nb: Man søker i dette delemnet å skape forståelse for konsepter fremfor detaljkunnskap om eksisterende materiell i Hæren.

source: English and Military Sports and Training (MIT)
nb: Engelsk og Militær idrett og trening (MIT)

source: • explain the various techniques for signal modulation/demodulation, coding/decoding, and system structure that is used in telecommunication networks
nb: • forklare de forskjellige teknikker for signalmodulering /demodulering, koding/dekoding, og systemoppbygging som brukes i telekommunikasjonsnett

source: Explain the legal arguments for weapons that are prohibited, partially banned and controversial.
nb: forklare rettslige begrunnelser for forbudte våpen, delvis forbudte våpen og omdiskuterte våpen.

source: The Sensor Systems course covers the radar course curriculum in Kjerstad, Part 2, chapter 2.1-2.6 (radar structure) and 2.14 (radiation hazards).
nb: Faget Sensorsystemer dekker radarpensumet i Kjerstad Del 2 kapittel 2.1-2.6 (radarens oppbygning) samt 2.14 (strålefare).

source: Consider the ethical, environmental, health, social and economic implications of your own and other’s actions within their field.
nb: Ta stilling til etiske, miljømessige, helsemessige, samfunnsmessige og økonomiske konsekvenser av produkter og løsninger innenfor sitt fagområde.

source: know of geotechnical elements in relevant Norwegian, NATO and international guidelines and standards.
nb: kjenner til geotekniske elementer i relevante norske, NATO og internasjonaler retningslinjer og standarder.

source: be aware of, and regulate, his/her own behaviour as an officer within situations characterised by stress.
nb: være bevisst og regulere egen atferd som offiser i situasjoner preget av stress.

source: The course includes a trip around central units in the Armed Forces, including NLOGS, FOH and other tactical units, to gain insight into the practical execution of operations and support of operations at several levels.
nb: Emnet inneholder en rundreise til sentrale avdelinger i Forsvaret, herunder NLOGS, FOH og andre taktiske avdelinger, for å få innsikt i den praktiske utførelsen av operasjoner og understøttelsen av operasjoner på flere nivå.

source: Academic methodology, theory of knowledge and decision theory provide a basis for critical thinking, an understanding of the premises and the frameworks for the staff study and the planning and decision-making process, as well as a foundation for the progression to master's studies.
nb: Vitenskapelig metode, kunnskapsteori og beslutningsteori gir et grunnlag for kritisk tenkning, en forståelse for premissene og rammene for stabsstudien og plan- og beslutningsprosessen og et grunnlag for å gå videre på masterstudier.

source: explain key concepts and methods in computer modelling, database theory and object-oriented programming.
nb: forklare sentrale begreper og metoder i datamodellering, databaseteori og objektorientert programmering.

source: find, evaluate, use and refer to information and subject matter and present this so that it sheds light on a problem.
nb: finne, vurdere, bruke og henvis til informasjon og fagstoff og fremstille dette slik at det belyser en problemstilling.

source: Resistance and propulsion:
nb: Motstand og framdrift:

source: Chapter 1.2.1 Position determination in all conditions
nb: kapittel 1.2.1 Posisjonsbestemmelse i alle forhold

source: Common features of all of these activities will be leadership, management, learning and teaching.
nb: Viktige fellestrekk ved alle kadettene sine aktiviteter i emnet er forvaltning, ledelse, læring og pedagogikk i praksis.

source: Propeller and water jet theory.
nb: Propell og vannjet-teori.

source: The education will enable the cadets to hold positions within Mission Support and consists of a combination of courses and "On the job training" (OJT) at the squadron.
nb: Utdanningen skal gjøre kadettene i stand til å bekle stillinger innen Mission Support og består av en kombinasjon av kurs og «On the job training» (OJT) ved skvadron.

source: Discuss your own leadership and development as an officer in terms of the profession's demands on the officer in challenging conflict conditions, and plan and implement a goal-oriented development of your own leadership platform.
nb: Diskutere og reflektere over eget lederskap og offisersutvikling under krevende forhold, og planlegge og gjennomføre målrettet lederutvikling.

source: Refer to the Copyright Act, Ministry of Education and Research circular F005-06,
nb: Det vises til Åndsverksloven, Kunnskapsdepartementets rundskriv F005-06,

source: apply a relevant set of concepts and formulae
nb: anvende et relevant begreps- og formelapparat

source: Within the topic of Land Operations, you study the operations in which the Army participates.
nb: I temaet Landoperasjoner studerer man hvilke operasjoner Hæren deltar i.

source: • calculate and describe electrical potential and voltage
nb: • beregne og beskrive elektrisk potensial og spenning

source: Section 1 addresses the characteristics of the profession and compares military values, culture and organisation with the same phenomena in civil society.
nb: Del 1 tar for seg profesjonens kjennetegn og sammenligner militære verdier, kultur og organisering med de samme fenomenene i det sivile samfunnet.

source: FOR-2018-05-18-870 and the national qualification framework.
nb: FOR-2018-05-18-870 og det nasjonale kvalifikasjonsrammeverket.

source: (up to 15000 words if 2 cadets write together).
nb: (inntil15000 ord hvis 2 kadetter skriver sammen).

source: Design and dimension simple bridging constructions.
nb: Prosjektere og dimensjonere enkle brukonstruksjoner.

source: Theme 3/Part 1: Means, effectiveness and limitations
nb: Tema 3/Del 1: Virkemidler, effektivitet og begrensninger

source: Learning occurs through a combination of pre-study, lectures, tutorials and problem solving.
nb: Emne er en kombinasjon av forstudi, leksjoner, veiledningstimer og oppgaveløsning.

source: describe various MilGeo capabilities in the Armed Forces
nb: beskrive ulike MilGeo-kapasiteter i Forsvaret

source: The purpose here is to provide the cadets with skills to safeguard their own learning processes.
nb: Hensikten er å gi kadettene ferdigheter til å ivareta egne læringsprosesser.

source: relate research and development work, new thinking and innovation in maritime subjects and military applications of those subject areas, and can update his/her knowledge of the technological developments within the naval defence combat arena.
nb: gjengi forsknings- og utviklingsarbeid, nytenking og innovasjon innenfor maritime fag og militær anvendelser av fagområdet, samt kan oppdatere sin kunnskap om den teknologiske utviklingen innen den sjømilitære stridsarenaen.

source: Interoperability and Federated Mission Networking (FMN)
nb: Interoperabilitet og Federated Mission Networking (FMN)

source: Here, cadets will experience being platoon commanders and co-operations officers in the Army.
nb: Kadettene vil her få erfaringer som troppssjef og samvirkeoffiser i Hæren.

source: • Green’s, Gauss’ and Stokes’ theorems
nb: • Greens, Gauss’ og Stokes’ teoremer

source: The theoretical section of the module employs customised educational lessons, including, among other things, self-study, group seminars, e-courses, mainstream and digital lectures and seminar lessons.
nb: Den teoretiske delen av modulen anvender tilpassede pedagogiske undervisningsopplegg, herunder blant annet egenstudier, kollokviegrupper, e-kurs, ordinære og digitaliserte forelesninger og seminarundervisning.

source: The study programme at the Norwegian Defence University College of Engineering - Telematics follows the framework plan for engineering education established by the Ministry of Education and Research (KD) in 2018.
nb: Studiet ved FHS/Cyberingeniørskolen følger rammeplan for ingeniørutdanning fastsatt av Kunnskapsdepartementet (KD) i 2018.

source: The second part of the course (second week) is sought to be completed digitally and will in its entirety deal with military problem solving and the approach to operational planning at the military strategic and operational level.
nb: Emnets andre del (andre uke) søkes gjennomført digitalt og vil i sin helhet omhandle militær problemløsning og tilnærming til operasjonsplanlegging på militærstrategisk og operasjonelt nivå.

source: Damage mechanisms and fault types in turbo engines.
nb: Skademekanismer og feiltyper på turbomaskiner.

source: effectively make wise decisions in light of strategic and tactical, physical and technical and legal and moral conditions.
nb: effektivt ta kloke beslutninger i lys av strategiske og taktiske, fysiske og tekniske, samt juridiske og moralske forhold.

source: Exhaust gas readings from combustion engines, processing of measured values, methods for reduction and processing.
nb: Avgassmålinger fra forbrenningsmaskiner, bearbeiding av målte verdier, metoder for reduksjon og behandling.

source: Lectures (lectures in digital techniques will be performed online), mandatory exercises and programming project.
nb: Forelesninger (i delemne digitalteknikk vil undervisningen foregå online), obligatoriske øvinger og programmeringsprosjekt.

source: Discuss the consequences of this capability, as well as the enemy’s and civilian technology for your own mission resolution.
nb: drøfte konsekvensene av egen, fiendens og sivil teknologi for egen oppdragsløsning.

source: In topic 4, the observations and reflections made regarding military leadership and personal conditions needed for their own officer development are summarised, and there is an increased motivation to purposefully develop themselves as future officers.
nb: I tema 4 søkes det å oppsummere de observasjoner og refleksjoner som er gjort vedrørende militært lederskap og personlige forutsetninger for egen offisersutvikling, og med det økt motivasjon til målrettet å utvikle seg som fremtidige offiserer.

source: Marine combustion engines and fuel cells’ actual processes and their efficiency levels, establishment of heat balances from simulations and laboratory exercises.
nb: Marine forbrenningsmaskiners og brenselcellers virkelige prosesser og deres virkningsgrader, etablering av varmebalanser fra simuleringer og laboratorieøvelser.

source: In connection with the course, a 360 degree evaluation will be carried out, which can be reviewed after the practice period.
nb: I forbindelse med emnet vil det gjennomføres en 360 graders måling, hvor de får tilbakelesing etter praksisperioden.

source: Notes and articles.
nb: Notater og artikler.

source: The subtopic will include an introduction to stress and coping with stress.
nb: Delemnet vil inneholde en innføring om stress og mestring av stress.

source: Only a few of the members have achieved the goal of spending 2 percent of GDP on defence, and the United States has recently increased pressure on its allies to spend more money on defence.
nb: Bare et fåtall av medlemmene har oppnådd målet om 2 prosent av BNP på forsvar, og USA har den siste tiden økt presset på sine allierte for å bruke mer penger på forsvar.

source: apply relevant terminology and a system of formulas
nb: anvende et relevant begreps- og formelapparat

source: • calculate with symbols and formulas in statistics
nb: • regne med symboler og formler i statistikk

source: knowledge of theories and methods of project management, including planning, organization, follow-up and management of engineering operations
nb: Kunnskap om teorier og metoder for prosjektledelse, herunder planlegging, organisering, oppfølging og ledelse av ingeniøroperasjoner

source: • describe methods for coding of signals
nb: • beskrive metoder for koding av signal

source: Use of international regulations, codes and standards that deal with safe handling, securing and transport of cargo.
nb: Bruk av internasjonalt regelverk, koder og standarder som har med sikker behandling, sikring og transport av last.

source: show physical, mental and moral robustness and function over time in critical situations characterised by chaos and insecurity, including being able to inflict enemy losses.
nb: vise fysisk, mental og moralsk robusthet og over tid virke i kritiske situasjoner preget av kaos og usikkerhet, herunder kunne påføre fienden tap.

source: relate relevant issues while navigating in control mode radar.
nb: relevante problemstillinger under seilas i kontrollmode radar.

source: The exercise should be seen in the context of the corresponding practical arena in the third academic year.
nb: Øvelsen bør sees i sammenheng med tilsvarende praktisk arena i tredje studieår.

source: Air consumption, air intake and exhaust systems of marine combustion engines.
nb: Luftforbruk, luftinntaks-, og eksossystemer til marine forbrenningsmotorer.

source: The course shall provide the cadet with knowledge on marine turbomachinery with emphasis on marine gas turbines, turbochargers and steam turbines.
nb: Emnet skal gi kadetten kunnskap innen marine turbomaskiner med vekt på marine gassturbiner, turboladere og dampturbiner.

source: Explain current issues in NATO and discuss how these affect the Armed Forces.
nb: Beskrive aktuelle problemstillinger i NATO og drøfte hvordan disse berører Forsvaret.

source: find, assess and refer to literature related to the planning and implementation of joint operations.
nb: finne, vurdere og henvise til fagstoff knyttet til planlegging og gjennomføring av fellesoperasjoner.

source: The connection between democratisation, conscription, militarism and the development of total war is illustrated.
nb: Sammenhengen mellom demokratisering, verneplikt, militarisme og utviklingen mot den total krig belyses.
